{
  "As_Hello": "Hello, I'm",
  "As_Description": "With 2 years of experience. I enjoy building sites & apps.<1></1>My focus is <2>React</2> & <3>Vue</3> with <4>Tailwindcss</4>",
  "As_About_Me": "About Me",
  "As_About_Text_1": "Hello, I'm Asuka and my Chinese name is 高梓竣(Gao Zi jun)",
  "As_About_Text_2": "In 2022, I took a compulsory course called HTML and JavaScript, and that’s when I fell in love with front-end development. I really enjoy the process of building web pages. During college, I collaborated with my friends on several projects and gained a strong sense of accomplishment. I graduated from Chongqing Normal University (CQNU) in 2025, and I am now working as a full-stack development engineer, mainly focusing on front-end development.",
  "As_About_Text_3": "I am proficient in technologies such as <1>React</1> & <2>Vue</2>, and I have a solid understanding of TypeScript and HTML/CSS.",
  "As_About_Text_4": "In my spare time, I will learn new technologies. I also love travel, photography and editing. I want to develop my own self-media account. I will see you soon. Please look forward to it.",
  "As_My_Skills": "My Skills",
  "As_My_Skills_Web": "Web Development",
  "As_My_Skills_Backend": "Backend Development",
  "As_My_Skills_Design": "Vision & Design",
  "As_Journey_Youth": "The journey of youth",
  "As_Journey_Youth_Text": "I graduated from college in June 2025. These are the journeys and memories of my youth.",
  "As_Journey_Youth_Collage": "Studying at Chongqing Normal University",
  "As_Journey_Youth_Major": "Computer Science and Technology Major",
  "As_Journey_Youth_Smart_CQNU": "Smart CQNU — WeChat Mini Program",
  "As_Journey_Youth_Smart_CQNU_Description": "This is a WeChat Mini Program — a comprehensive campus portal and entertainment platform — that I developed together with two like-minded college classmates and successfully deployed online. I felt very happy when my friends and classmates around me started using the Mini Program I created.",
  "As_Journey_Youth_YunNan": "Journey to Shangri-La, Yunnan",
  "As_Journey_Youth_YunNan_Description": "Ever since I fell in love with photography and became overwhelmed by the fast pace of city life, I no longer long for big cities. Instead, I yearn to get closer to nature — to feel it, to embrace it. The Tibetan region has become my favorite place, with its fascinating Tibetan culture and distinctive traditional architecture. There, the sky is crystal clear, and the clouds seem close enough to touch. Even the air carries a sense of tranquility and purity. Every time I set foot on that land, I feel a deep sense of peace and strength within. Perhaps this is the rhythm of life I have been searching for — free from the noise, returning to the truest version of myself.",
  "As_Journey_Youth_Hikvision": "Hangzhou Hikvision Digital Technology Co., Ltd",
  "As_Journey_Youth_Hikvision_Description_1": "It is mainly aimed at participating in the development of international projects and the customization of project personalization. It uses micro-front-end architecture combined with Vue2 to realize the sub-application development of different functional modules, and modifies or develops the sub-applications of the corresponding projects on the basis of the baseline according to the different personalization and other needs of projects in various countries.",
  "As_Journey_Youth_Hikvision_Description_2": "Use Hikvision to develop the internal component library to quickly build the page and provide the events, attributes, apis, etc. of modified related components to improve the overall development efficiency.",
  "As_Journey_Youth_Hikvision_Description_3": "Actively cooperate and coordinate with other group members, communicate requirements and access interfaces, follow the standard development specifications and development processes, and improve development efficiency and team coordination.",
  "As_Journey_Youth_Hikvision_Description_4": "Regular group meetings to report the complete progress of recent development projects, such as development, development joint adjustment, test cases, project completion, etc., have a perfect team building and development specifications, and have team management experience based on the above.",
  "As_Journey_Youth_Kangding": "Journey to Kangding, Western Sichuan",
  "As_Journey_Youth_Kangding_Description_1": "It was my first time setting foot in Western Sichuan, my first trip with friends, and also my first time truly learning to let go after a major upheaval in my family. The journey came so suddenly that we were almost completely unprepared — none of us expected to challenge the steep mountain trails of the highlands. Along the way, though we were breathless and exhausted, there was far more laughter and emotion than fatigue.",
  "As_Journey_Youth_Kangding_Description_2": "On that vast plateau, the wind was cold, yet the sky was strikingly blue. The sunlight shimmered on the snow-capped peaks, and even the air seemed filled with healing power. Just a month before, I had been suffocated by pain and confusion, but this journey helped me rediscover peace and courage. Perhaps that’s what life is about — only by stepping beyond the familiar can we truly see into our own hearts.",
  "As_Journey_Youth_Leapmotor": "Leapmotor Technologies Co., Ltd.",
  "As_Journey_Youth_Leapmotor_Description": "I joined the company as a campus recruit in June 2025. I work in the Platform Software Department at Leapmotor Technologies Co., Ltd., where I am responsible for the web development of the company’s internal comprehensive vehicle management platform. Since joining, I have participated in the platform’s refactoring from Vue to React, developed reusable business components for the React version, and built the documentation website for the component library. In the future, I will continue to create more meaningful and valuable contributions.",
  "As_Journey_Youth_Future": "Future",
  "As_Journey_Youth_Story_Future": "The story of the future......",
  "As_Journey_Youth_Story_Future_Description_1": "My story is still unfolding. Although life can sometimes be filled with pain and uncertainty, I still choose to move forward. The road ahead may not always be smooth, but I will carry my past experiences and growth with me as I continue to seek my own light. The moments that once broke me have now turned into the strength that supports me. No matter how far or difficult the journey ahead may be, I will keep walking with a smile — because I know that only by moving forward can life reveal new and beautiful horizons.",
  "As_Journey_Youth_Story_Future_Description_2": "If you’d like to learn more about my story, feel free to follow me or contact me:",
  "As_Email": "Email",
  "As_WeChat": "WeChat",
  "As_DownLoad_CV": "DownLoad CV"
}
