{
  "As_Hello": "こんにちは、私は",
  "As_Description": "2 年間のフロントエンド開発経験があり、ウェブサイトやアプリを構築することが好きです。<1></1>私の主な技術スタックは <2>React</2> & <3>Vue</3> と <4>Tailwindcss</4> です。",
  "As_About_Me": "私について",
  "As_About_Text_1": "こんにちは、私は Asuka、私の中国語の名前は 高梓竣（ガオ・ズージュン）です。",
  "As_About_Text_2": "2022 年、HTML と JavaScript の必修課程を履修し、そこでフロントエンド開発に恋をしました。ウェブページを構築するプロセスをとても楽しんでいます。大学時代に友人と複数のプロジェクトを協力して進め、大きな達成感を得ました。2025 年に重慶師範大学を卒業し、現在はフルスタック開発エンジニアとして主にフロントエンド開発に取り組んでいます。",
  "As_About_Text_3": "<1>React</1> & <2>Vue</2> などの技術に精通しており、TypeScript や HTML/CSS の理解も堅固です。",
  "As_About_Text_4": "余暇には新しい技術を学びます。また、旅行、写真、編集が大好きです。自分のメディアアカウントを展開したいと思っています。すぐにお会いしましょう。どうぞ楽しみに。",
  "As_My_Skills": "私のスキル",
  "As_My_Skills_Web": "Web開発",
  "As_My_Skills_Backend": "バックエンド開発",
  "As_My_Skills_Design": "ビジョン＆デザイン",
  "As_Journey_Youth": "青春の旅路",
  "As_Journey_Youth_Text": "私は 2025 年 6 月に大学を卒業しました。これは私の青春時代の旅と記憶です。",
  "As_Journey_Youth_Collage": "重慶師範大学で学び",
  "As_Journey_Youth_Major": "コンピュータ科学技術専攻",
  "As_Journey_Youth_Smart_CQNU": "スマート CQNU — WeChat ミニプログラム",
  "As_Journey_Youth_Smart_CQNU_Description": "これは私と志を同じくする大学の仲間たちと共同で開発した WeChat ミニプログラム――総合キャンパスポータルとエンターテインメントプラットフォームで、無事に配信されました。周りの友人や同級生が私が作ったミニプログラムを使い始めた時、とても嬉しかったです。",
  "As_Journey_Youth_YunNan": "雲南シャングリラへの旅",
  "As_Journey_Youth_YunNan_Description": "写真に惹かれ、都市の速いペースに息苦しさを感じて以来、大都市に憧れることはなくなりました。代わりに、自然に近づきたい――感じたい、抱きしめたい。チベット地域は私のお気に入りの場所となり、その魅力的なチベット文化と特徴的な伝統建築に心を惹かれました。そこには澄んだ空と雲が手の届くようで、空気は穏やかで純粋な気配を帯びています。その土地を踏むたびに、私は内なる平穏と力を感じます。おそらくこれが私がずっと探していた生き方――喧騒から離れ、最も真実の自分へ回帰するものです。",
  "As_Journey_Youth_Hikvision": "杭州ハイクビジョンデジタルテクノロジー株式会社",
  "As_Journey_Youth_Hikvision_Description_1": "主に国際プロジェクト開発およびプロジェクトのカスタマイズに参加しています。マイクロフロントエンド構造と Vue2 を組み合わせて、異なる機能モジュールのサブアプリケーションを実現し、各国プロジェクトの個別化ニーズに基づいて該当サブアプリを改修・開発しました。",
  "As_Journey_Youth_Hikvision_Description_2": "海康を用いて内部コンポーネントライブラリを開発し、ページを迅速に構築し、修正関連コンポーネントのイベント、属性、API などを提供して、開発効率を全体的に向上させました。",
  "As_Journey_Youth_Hikvision_Description_3": "他のグループメンバーと積極的に協力・調整し、要件およびインターフェースをコミュニケーションし、開発標準仕様および開発プロセスを順守し、開発効率およびチーム協調能力を向上させました。",
  "As_Journey_Youth_Hikvision_Description_4": "定期的にグループミーティングを開催し、最近の開発プロジェクトの進捗（開発、共同調整、テストケース、プロジェクト完成など）を報告し、完璧なチームビルディングと開発規範を形成しており、上記を基にしたチームマネジメント経験を蓄積しました。",
  "As_Journey_Youth_Kangding": "カンディン（四川省西部）への旅",
  "As_Journey_Youth_Kangding_Description_1": "これは私が初めて川西を踏んだ旅で、友人との初旅行でもあり、また家族に大きな変故があった後、私が初めて本当に手放すことを学んだ時でもありました。旅は突然来て、私たちはほとんど全く準備していませんでした――誰も高原の険しい山道に挑むとは予想していませんでした。道中、息切れし疲れ果てましたが、疲れよりもむしろ笑いと感動が勝りました。",
  "As_Journey_Youth_Kangding_Description_2": "あの広大な高原では、風は冷たく、しかし空は驚くほど青かった。陽光が雪山の峰にちらつき、空気までもが癒しの力を帯びているようでした。ちょうど一ヶ月前、私は痛みと混乱に追われていましたが、この旅が私に再び平穏と勇気をもたらしました。恐らく、これが人生なのです――慣れ親しんだものから踏み出してこそ、自分の心を本当に見つめることができます。",
  "As_Journey_Youth_Leapmotor": "Leapmotor テクノロジーズ株式会社",
  "As_Journey_Youth_Leapmotor_Description": "私は 2025 年 6 月、キャンパス採用として入社し、Leapmotor テクノロジーズ株式会社のプラットフォームソフトウェア部門に勤務し、社内総合車両管理プラットフォームの Web 開発を担当しました。入社以来、プラットフォームの Vue から React へのリファクタリングに参加し、React バージョンの再利用可能なビジネスコンポーネントを開発し、コンポーネントライブラリのドキュメンテーションサイトを構築しました。今後もより意味と価値のある貢献を継続していきます。",
  "As_Journey_Youth_Future": "未来",
  "As_Journey_Youth_Story_Future": "未来の物語……",
  "As_Journey_Youth_Story_Future_Description_1": "私の物語はまだ続いています。人生は時に痛みと不確実性に満ちているかもしれませんが、私はそれでも前進を選びます。前方の道は必ずしも平坦ではないかもしれませんが、私は過去の経験と成長を携え、自分だけの光を探し続けます。かつて私を崩壊させた瞬間は、今では私を支える力に変わりました。どんなに遠く、どんなに困難な旅であっても、私は笑顔で歩み続けます――なぜなら、前進することでこそ人生には新しい美しさが現れると知っているからです。",
  "As_Journey_Youth_Story_Future_Description_2": "私の物語をもっと知りたい方は、ぜひフォローまたはご連絡ください：",
  "As_Email": "メール",
  "As_WeChat": "WeChat",
  "As_DownLoad_CV": "履歴書をダウンロード"
}
