{
  "As_Hello": "안녕하세요, 저는",
  "As_Description": "2년간의 프론트엔드 개발 경험을 가지고 있으며, 웹사이트와 앱을 만드는 것을 좋아합니다.<1></1>저의 주요 기술 스택은 <2>React</2> & <3>Vue</3> 그리고 <4>Tailwindcss</4> 입니다.",
  "As_About_Me": "저에 대해",
  "As_About_Text_1": "안녕하세요, 저는 Asuka이고, 제 중국어 이름은 고쯔쥔(高梓竣)입니다.",
  "As_About_Text_2": "2022년에 HTML과 JavaScript 필수 과목을 수강하면서 프론트엔드 개발에 빠졌습니다. 웹페이지를 구성하는 과정을 정말 즐깁니다. 대학 시절 친구들과 여러 프로젝트를 협업하며 강한 성취감을 느꼈습니다. 저는 2025년 중경사범대학교(Chongqing Normal University)를 졸업했으며, 현재는 풀스택 개발 엔지니어로 주로 프론트엔드 개발에 집중하고 있습니다.",
  "As_About_Text_3": "<1>React</1> & <2>Vue</2> 같은 기술에 능숙하며, TypeScript와 HTML/CSS에 대한 탄탄한 이해를 가지고 있습니다.",
  "As_About_Text_4": "여가 시간에는 새로운 기술을 배우며, 여행, 사진, 편집을 좋아합니다. 제 개인 미디어 계정을 운영하고 싶습니다. 곧 만나요. 기대해 주세요.",
  "As_My_Skills": "나의 스킬",
  "As_My_Skills_Web": "웹 개발",
  "As_My_Skills_Backend": "백엔드 개발",
  "As_My_Skills_Design": "비전 & 디자인",
  "As_Journey_Youth": "청춘의 여정",
  "As_Journey_Youth_Text": "저는 2025년 6월에 대학을 졸업했습니다. 이것은 제 청춘기의 여정과 기억입니다.",
  "As_Journey_Youth_Collage": "중경사범대학교에서 공부",
  "As_Journey_Youth_Major": "컴퓨터 과학 및 기술 전공",
  "As_Journey_Youth_Smart_CQNU": "스마트 CQNU — WeChat 미니프로그램",
  "As_Journey_Youth_Smart_CQNU_Description": "이것은 제와志同道合(뜻이 맞는) 대학 동료 몇 명이 함께 개발한 WeChat 미니프로그램—종합 캠퍼스 포털 및 엔터테인먼트 플랫폼—으로, 성공적으로 출시되었습니다. 주변 친구들과 동급생들이 제가 만든 미니프로그램을 사용하기 시작했을 때, 저는 정말 기뻤습니다.",
  "As_Journey_Youth_YunNan": "운남 샹그릴라 여행",
  "As_Journey_Youth_YunNan_Description": "사진을 사랑하게 된 이후, 그리고 도시의 빠른 속도에 숨이 막히듯 느껴진 이후로, 저는 더 이상 대도시에 동경하지 않습니다. 대신 자연에 더 가까이 가고 싶습니다—느끼고, 포옹하고 싶습니다. 티베트 지역은 제가 가장 좋아하는 장소가 되었고, 그 매혹적인 티베트 문화와 독특한 전통 건축에 마음이 끌렸습니다. 그곳의 하늘은 맑았으며 구름은 닿을 듯 가까웠고, 공기마저 평온하고 순수한 기운을 지녔습니다. 그 땅을 밟을 때마다 저는 내면 깊은 곳에서 평온과 힘을 느낍니다. 아마도 이것이 제가 오랫동안 찾아왔던 삶의 리듬일 것입니다—소란을 벗어나, 가장 진실한 나로 돌아가는 것.",
  "As_Journey_Youth_Hikvision": "항저우 하이크비전 디지털 테크놀로지 유한공사",
  "As_Journey_Youth_Hikvision_Description_1": "주로 국제 프로젝트 개발 및 프로젝트 맞춤화에 참여했습니다. 마이크로 프런트엔드 아키텍처와 Vue2를 결합하여 다른 기능 모듈의 서브 애플리케이션 개발을 실현했고, 프로젝트별 개인화 요구에 따라 해당 서브 애플리케이션을 수정하거나 개발했습니다.",
  "As_Journey_Youth_Hikvision_Description_2": "하이크비전에 내부 컴포넌트 라이브러리를 개발하여 페이지를 빠르게 구축하고, 수정 관련 컴포넌트의 이벤트·속성·API 등을 제공하여 전체 개발 효율성을 향상시켰습니다.",
  "As_Journey_Youth_Hikvision_Description_3": "다른 그룹 구성원과 적극적으로 협력 및 조정했으며, 요구 사항과 인터페이스를 소통하고, 개발 표준 사양과 개발 프로세스를 준수하여 개발 효율성과 팀 협업 능력을 향상시켰습니다.",
  "As_Journey_Youth_Hikvision_Description_4": "정기적으로 그룹 회의를 개최하여 최근 개발 프로젝트의 전체 진행 상황(개발, 공동 조정, 테스트 케이스, 프로젝트 완료 등)을 보고했으며, 완벽한 팀 빌딩 및 개발 규범을 형성하고 위 경험을 바탕으로 팀 관리 경험을 축적했습니다.",
  "As_Journey_Youth_Kangding": "산시성 서부 칭쯔(甘孜) 캉딩 여행",
  "As_Journey_Youth_Kangding_Description_1": "이것은 제가 처음으로 쓰촨 서부를 밟은 여정이자, 친구들과의 첫 여행이었고, 또한 가족에 큰 변화가 있은 뒤 제가 처음으로 진정으로 놓아 주는 법을 배운 시간이기도 했습니다. 여행은 너무 갑작스럽게 왔고 우리는 거의 아무 준비도 없었습니다―누구도 고원 험한 산길에 도전할 줄은 몰랐습니다. 길 위에서 숨이 차고 지쳤지만, 피로보다 웃음과 감동이 더 많았습니다.",
  "As_Journey_Youth_Kangding_Description_2": "그 광활한 고원에서 바람은 차가웠고, 그럼에도 하늘은 놀랍도록 푸르렀습니다. 햇빛이 설산 봉우리 위에 반짝였고, 공기마저 치유의 힘을 품고 있는 것 같았습니다. 불과 한 달 전 저는 고통과 혼란에 시달렸지만 이 여행이 제게 다시 평온과 용기를 가져다 주었습니다. 아마도 이것이 인생입니다―익숙한 것을 벗어나야 비로소 진정으로 자신의 마음을 마주할 수 있는 것.",
  "As_Journey_Youth_Leapmotor": "레프모터 테크놀로지스 유한공사",
  "As_Journey_Youth_Leapmotor_Description": "저는 2025년 6월 캠퍼스 채용으로 입사해 레프모터 테크놀로지스 유한공사의 플랫폼 소프트웨어 부문에서 근무하며 회사 내부 종합 차량 관리 플랫폼의 웹 개발을 담당했습니다. 입사 이후 플랫폼의 Vue → React 리팩토링에 참여했고, React 버전의 재사용 가능한 비즈니스 컴포넌트를 개발했으며, 컴포넌트 라이브러리의 문서화 사이트를 구축했습니다. 앞으로도 계속 더 의미 있고 가치 있는 기여를 해나가겠습니다.",
  "As_Journey_Youth_Future": "미래",
  "As_Journey_Youth_Story_Future": "미래의 이야기……",
  "As_Journey_Youth_Story_Future_Description_1": "저의 이야기는 아직 진행 중입니다. 인생은 때때로 고통과 불확실성으로 가득할 수 있지만, 저는 그럼에도 앞으로 나아가기로 선택합니다. 앞에 놓인 길이 항상 순탄하지만은 않을지라도, 저는 지난 경험과 성장을 지니고 저만의 빛을 계속 찾아 나아갑니다. 한때 저를 무너뜨렸던 순간들은 이제 저를 지탱하는 힘으로 바뀌었습니다. 아무리 길고 어렵더라도 저는 미소 지으며 걸어갑니다――왜냐하면 앞으로 나아가야만 인생은 새로운 아름다움을 드러낸다는 것을 알기 때문입니다。",
  "As_Journey_Youth_Story_Future_Description_2": "저의 이야기를 더 알고 싶으시다면, 팔로우하거나 연락 주세요：",
  "As_Email": "이메일",
  "As_WeChat": "WeChat",
  "As_DownLoad_CV": "이력서를 다운로드"
}
